app/controllers/application_controller.rb

    def define_current_user

        begin

            # request.headers = eyJhbGciOiJIUzI1NiJ9.eyJpZCI6MX0.A6uJWtxKMq_aarBbagofRur0yC0RC-ZFpMDxi3N1kxE
            token = request.headers['Authorization'].split(' ')[1]
            # type, token = request.headers['Authorization'].split(' ')

            payload = JWT.decode(token, 'woeufnsldnfjd')[0]

            # payload, header = JWT.decode(token, '65bc368fbc69306')

            @current_user = User.find(payload['id'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]