app/controllers/meals_controller.rb

    def show
        mealplan = Mealplan.find(params[:id])
---
SELECT  "mealplans".* FROM "mealplans" WHERE "mealplans"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]