app/controllers/meals_controller.rb

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
---
    def show
        meal = Meal.find(params[:id])

INSERT INTO "meals" ("mealplan_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["mealplan_id", 50], ["recipe_id", 51], ["created_at", "2019-09-09 18:14:45.602208"], ["updated_at", "2019-09-09 18:14:45.602208"]]
---
    def create
        meal = Meal.new(meal_params)
        # meal.mealplan = self.id
        # meal.recipe = self.id
        # meal.save
        # render json: mealplan
        meal.save

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 99]]
SELECT "meals".* FROM "meals"
---
    def destroy
        meal = Meal.find(params[:id])
        meal.destroy
        meals = Meal.all

SELECT "meals".* FROM "meals"
---
    def index
        meal = Meal.all