app/controllers/mealplan_controller.rb

    def show
        mealplan = Mealplan.find(params[:id])
---
SELECT  "mealplans".* FROM "mealplans" WHERE "mealplans"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def create
        mealplan = Mealplan.new(mealplan_params)
        mealplan.user = self.current_user
        mealplan.save
        params[:meals].each do | meal |
---
SELECT "meals".* FROM "meals" WHERE "meals"."mealplan_id" = $1  [["mealplan_id", 1]]

    def index
       # mealplan = self.current_user.mealplans
        mealplans = Mealplan.all
---
SELECT "mealplans".* FROM "mealplans"